In [1]:
import pandas as pd

In [2]:
data = [(1, 2, 3, 4),
        (5, 6, 7, 8),
        (8, 10, 11, 12),
        (13, 14, 15, 16)]
df = pd.DataFrame(data, 'l1 l2 l3 l4'.split(), 'c1 c2 c3 c4'.split())

In [3]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [4]:
# Selecionando apenas a coluna c1

df["c1"]

l1     1
l2     5
l3     8
l4    13
Name: c1, dtype: int64

In [5]:
# Selecionando a coluna c3 e c1 (nessa ordem)

df[["c3", "c1"]]

    c3  c1
l1   3   1
l2   7   5
l3  11   8
l4  15  13

In [6]:
# Selecionando todas as linhas a partir do index padr√£o
# do dataframe

df[:]

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [10]:
# Selecionando todas as linhas a partir do index definido
# que seria a 3 linha

df[2:]

    c1  c2  c3  c4
l3   8  10  11  12
l4  13  14  15  16

In [11]:
# Selecionando apenas o intervalo do meio

df[2:4]

    c1  c2  c3  c4
l3   8  10  11  12
l4  13  14  15  16

In [12]:
# Selecionando apenas colunas espec√≠ficas de linhas espec√≠ficas

df[1:][["c3", "c1"]]

    c3  c1
l2   7   5
l3  11   8
l4  15  13

In [14]:
# Fun√ß√£o LOC permite fazer consulta a partir 
# das linhas, tornando elas uma serie com a coluna sendo o indice

df.loc["l3"]

c1     8
c2    10
c3    11
c4    12
Name: l3, dtype: int64

In [15]:
# Fun√ß√£o ILOC permite a mesma coisa que a LOC
# por√©m ao inv√©s de usar o indice informado na linha
# com essa fun√ß√£o usamos o √≠ndice num√©rico

df.iloc[2]

c1     8
c2    10
c3    11
c4    12
Name: l3, dtype: int64

In [18]:

selecao = alunos['Aprovado'] == False
reprovados = alunos.iloc[selecao, ['Nome', 'Sexo', 'Idade']]
reprovados

NameError: name 'alunos' is not defined